# Python_Pandas_Introduction

<img align="center" width="700" height="700"  src="images/pandas-apps.png"  >

> **Pandas is an open source python library built on top of numpy and provides easy to use data structures and data analysis tools. Pandas has derived its name from panel data system and was developed by wes mckinney in 2008.**

> **Data scientists use pandas for performing various data science tasks starting from downloading, opening, reading and writing files of different file formats like csv, excel, json, html and so on. They load the data set into its data structure called data frame.**

> **A Pandas Dataframe is a 2-dimensional labeled data structure (like SQL table) with heterogeneously typed columns, having both a row and a column index.**

> **After the data is loaded in a data frame the data scientists perform a various data manipulation tasks like filtering and modifying data based on multiple conditions cutting, splitting, merging, sorting, scaling, pivoting and aggregating of data.**

> **Data cleaning is done to enhance the data accuracy and integrity by identifying and removing null values, duplicates and outliers.**

> **Data wrangling actually transforms the data structurally to appropriate format and makes it ready to be used by the machine learning engineers so that they can apply appropriate machine learning models or algorithm on that data set for training validating and testing purposes.**

## Learning Agenda of this Notebook:
- What is Pandas and how is it used in AI?
- Key features of Pandas
- Data Types in Pandas
- What does Pandas deal with?
- Creating Series and Dataframes in Pandas
- Data Handling with Pandas
  - Practice Exercise I
  - Practice Exercise II
- All Statistical functions in Pandas
- Input/Output Operations
- Aggregation & Grouping
  - Practice Exercise
- Merging, Joining and Concatenation
  - Practice Exercise
- How To Perform Data Visualization with Pandas
- Exercise I
- Exercise II
- Pandas's Assignment

### Data Structures in Pandas:
<img src="https://www.databricks.com/wp-content/uploads/2019/03/pandas1.png">

In [ ]:
Module1 : Introduction to Python 
Module2: Python Libraries(NumPy, Pandas)

>-  **A Pandas Dataframe is a 2-dimensional labeled data structure (like SQL table) with heterogeneously typed columns, having both a row and a column index.**
>-  **In short Pandas is a Software Libarary in Computer Programming and it is written for the Python Programming Language its work to do `data analysis and manipulation.`**

## So, what is Pandas and how is it used in AI?

Artificial Intelligence is about executing machine learning algorithms on products that we use every day. Any ML algorithm, for it to be effective, needs the following prerequisite steps to be done.
- `Data Collection` – Conducting opinion Surveys, scraping the internet, etc.
- `Data Handling` – Viewing data as a table, performing cleaning activities like checking for spellings, removal of blanks and wrong cases, removal of invalid values from data, etc.
- `Data Visualization` – plotting appealing graphs, so anyone who looks at the data can know what story the data tells us.
- `Pandas` – short for `Panel Data` (A panel is a 3D container of data) – is a library in python which contains in-built functions to clean, transform, manipulate, visualize and analyze data.

## Key Features of Pandas
<img src="images/Python-Pandas-Features.webp" height=600px width=600px>


- It has a fast and efficient DataFrame object with the default and customized indexing.
- Used for reshaping and pivoting of the data sets.
- Group by data for aggregations and transformations.
- It is used for data alignment and integration of the missing data.
- Provide the functionality of Time Series.
- Process a variety of data sets in different formats like matrix data, tabular heterogeneous, time series.
- Handle multiple operations of the data sets such as subsetting, slicing, filtering, groupBy, re-ordering, and re-shaping.
- It integrates with the other libraries such as SciPy, and scikit-learn.
- Provides fast performance, and If you want to speed it, even more, you can use the Cython.

## Data Types
A data type is used by a programming language to understand how to store and manipulate data.
- `int` : Integer number, eg: 10, 12
- `float` : Floating point number, eg: 100.2, 3.1415
- `bool` : True/False value
- `object` : Test, non-numeric, or a combination of text and non-numeric values, eg: Apple
- `DateTime` : Date and time values
- `category` : A finite list of values

## What does Pandas deal with?
There are two major categories of data that you can come across while doing data analysis.
- One dimensional data
- Two-dimensional data

These data can be of any data type. Character, number or even an object.

> **Series in Pandas is one-dimensional data, and data frames are 2-dimensional data. A series can hold only a single data type, whereas a data frame is meant to contain more than one data type.**

![](images/dataframe.webp)

**In the example shown above, `Name` is a `series` and it is of the datatype – `Object` and it is treated as a character array. `Age` is another series and it is of the type – `Integer`. Third is the `Marks` is the third series and it is of the type `Integer` again.  The individual Series are one dimensional and hold only one data type. However, the `dataframe` as a whole contains more than 2 dimensions and is `heterogeneous` in nature.**

## Creating Series & data frames in python

#### Creating a simple Serie

In [1]:
import pandas as pd

In [2]:
pd.__version__, pd.__path__

('2.2.3',
 ['/Users/ehtishamsadiq/Data/Leo Behe/myvenv/lib/python3.11/site-packages/pandas'])

In [3]:

#importing pandas library
import pandas as pd
 
#Creating a list
name = ['Ehtisham', 'Ali', 'Ayesha', 'Dua']

#Creating a Series by passing list variable to Series() function of pandas 
name_series = pd.Series(name)

#Printing Series
print(name_series)

0    Ehtisham
1         Ali
2      Ayesha
3         Dua
dtype: object

In [4]:
# Let’s check type of Series
print("Type of name_Series is : ",type(name_series))

Type of name_Series is :  <class 'pandas.core.series.Series'>

#### Creating multiple series

In [5]:
name = ['Ehtisham', 'Ali', 'Ayesha', 'Dua']
marks = [91.5,93,80,65]
age = [21,18,16,6]

#Creating a Series by passing list variable to Series() function of pandas 
name_ser = pd.Series(name)
marks_ser = pd.Series(marks)
age_ser = pd.Series(age)

#Printing Series
print("Name Series : ", name_ser, sep="\n")
print("Marks Series : ", marks_ser, sep="\n")
print("Age Series : ", age_ser,sep="\n")

Name Series :
0    Ehtisham
1         Ali
2      Ayesha
3         Dua
dtype: object
Marks Series :
0    91.5
1    93.0
2    80.0
3    65.0
dtype: float64
Age Series :
0    21
1    18
2    16
3     6
dtype: int64

#### Creating Dataframe from multiple Series

In [6]:
#Creating a Series by passing list variable to Series() function of pandas 
name_ser = pd.Series(name)
marks_ser = pd.Series(marks)
age_ser = pd.Series(age)

# Creating a Dictionary by passing series as values of dictionary
dic = {'Name':name_ser,
      'Marks':marks_ser,
      'Age':age_ser
      }

# Create dataframe by passing dictionary to pd.DataFrame function of pandas
df = pd.DataFrame(dic)
print("Printing of DataFrame .... ")
df

Printing of DataFrame ....

       Name  Marks  Age
0  Ehtisham   91.5   21
1       Ali   93.0   18
2    Ayesha   80.0   16
3       Dua   65.0    6

#### How to add new column to the dataframe

In [7]:
address = pd.Series(['Lahore','Okara','Okara'])
##Creating new column in the dataframe by providing s Series created using list
df['Address'] = address
print("Printing of DataFrame .... ")
df

Printing of DataFrame ....

       Name  Marks  Age Address
0  Ehtisham   91.5   21  Lahore
1       Ali   93.0   18   Okara
2    Ayesha   80.0   16   Okara
3       Dua   65.0    6     NaN

## Data Handling with Pandas..

- **Data Reading** : Reading from a csv or an excel – Pandas provide two functions – read_csv() and read_excel() to read data from a csv and an excel file respectively. Command can be used as follows.

- **Viewing data** – Viewing data from a data frame can be done by three ways
 >- using the data frame’s name – returns the top and bottom 5 rows in the data frame.
 >- using dataframe.head() function
 >- using dataframe.tail() function

- **Data Overview** : To see more details on the data frame, the `info()` function can be used. info() gives an idea about what datatype each series in a data frame points to.

- The following functions are used to find the unique entries within a series/column in a data frame.
 >- datafame.unique() – returns the unique values
 >- dataframe.nunique() – returns the count of unique values
 >- dataframe.value_counts() – returns the frequency of each of the categories in the column

- In our example, the titanic dataset contains a column called `Survived` which tells if the particular passenger survived the tragedy. Since this value could only be either 0 or 1, we can convert the data type from integer to object.
 >- `dataframe.astype()` is the function which lets us do the conversion

In [8]:
import os
os.listdir('datasets/')

['simple.json',
 'my_csv.csv',
 'long-beach-output.txt',
 'big_mart_sales_with_multiple_sheets.xlsx',
 'people.csv',
 '.DS_Store',
 'classmarkswithtab.csv',
 'imdb.txt',
 'so_survey_subset_schema.csv',
 'drinks.csv',
 'Automobile_data.csv',
 'classmarksgroupB.csv',
 'datawithdelimiter.csv',
 'student.csv',
 'big_mart_sales.csv',
 'boxplot.csv',
 'so_survey_subset.csv',
 'temp.xlsx',
 'tips.csv',
 'data.csv',
 'avengers1.csv',
 'classmarkswithtopcomments.csv',
 'temp.json',
 'simple_records.json',
 'groupbydata2.csv',
 'groupbydata3.csv',
 'groupdata.csv',
 'car_crashes.csv',
 'recent-grads.csv',
 'groupbydata1.csv',
 'temp copy.xlsx',
 'Euro_2012_stats_TEAM.csv',
 'data0.txt',
 'u.user',
 'classmarks.csv',
 'brain_networks.csv',
 'data1.txt',
 'classmarks.xlsx',
 'classmarkswithoutcollabels.csv',
 'practice',
 'long-beach.txt',
 'checkpoint2.csv',
 'checkpoint3.csv',
 'checkpoint1.csv',
 'cardekho_dataset.csv']

In [9]:
import pandas as pd
df = pd.read_csv('datasets/recent-grads.csv')

In [10]:
df.head() # top 5 records of dataframe

,Rank,Major_code,Major,Total,Men,Women,Major_category,ShareWomen,Sample_size,Employed,...,Part_time,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs
0,1,2419,PETROLEUM ENGINEERING,2339.0,2057.0,282.0,Engineering,0.120564,36,1976,...,270,1207,37,0.018381,110000,95000,125000,1534,364,193
1,2,2416,MINING AND MINERAL ENGINEERING,756.0,679.0,77.0,Engineering,0.101852,7,640,...,170,388,85,0.117241,75000,55000,90000,350,257,50
2,3,2415,METALLURGICAL ENGINEERING,856.0,725.0,131.0,Engineering,0.153037,3,648,...,133,340,16,0.024096,73000,50000,105000,456,176,0
3,4,2417,NAVAL ARCHITECTURE AND MARINE ENGINEERING,1258.0,1123.0,135.0,Engineering,0.107313,16,758,...,150,692,40,0.050125,70000,43000,80000,529,102,0
4,5,2405,CHEMICAL ENGINEERING,32260.0,21239.0,11021.0,Engineering,0.341631,289,25694,...,5180,16697,1672,0.061098,65000,50000,75000,18314,4440,972

In [11]:
df.tail()

,Rank,Major_code,Major,Total,Men,Women,Major_category,ShareWomen,Sample_size,Employed,...,Part_time,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs
168,169,3609,ZOOLOGY,8409.0,3050.0,5359.0,Biology & Life Science,0.637293,47,6259,...,2190,3602,304,0.046320,26000,20000,39000,2771,2947,743
169,170,5201,EDUCATIONAL PSYCHOLOGY,2854.0,522.0,2332.0,Psychology & Social Work,0.817099,7,2125,...,572,1211,148,0.065112,25000,24000,34000,1488,615,82
170,171,5202,CLINICAL PSYCHOLOGY,2838.0,568.0,2270.0,Psychology & Social Work,0.799859,13,2101,...,648,1293,368,0.149048,25000,25000,40000,986,870,622
171,172,5203,COUNSELING PSYCHOLOGY,4626.0,931.0,3695.0,Psychology & Social Work,0.798746,21,3777,...,965,2738,214,0.053621,23400,19200,26000,2403,1245,308
172,173,3501,LIBRARY SCIENCE,1098.0,134.0,964.0,Education,0.877960,2,742,...,237,410,87,0.104946,22000,20000,22000,288,338,192

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173 entries, 0 to 172
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Rank                  173 non-null    int64
 1   Major_code            173 non-null    int64
 2   Major                 173 non-null    object
 3   Total                 172 non-null    float64
 4   Men                   172 non-null    float64
 5   Women                 172 non-null    float64
 6   Major_category        173 non-null    object
 7   ShareWomen            172 non-null    float64
 8   Sample_size           173 non-null    int64
 9   Employed              173 non-null    int64
 10  Full_time             173 non-null    int64
 11  Part_time             173 non-null    int64
 12  Full_time_year_round  173 non-null    int64
 13  Unemployed            173 non-null    int64
 14  Unemployment_rate     173 non-null    float64
 15  Median                173 non-null    int64
 16  P25th                 173 non-null    int64
 17  P75th                 173 non-null    int64
 18  College_jobs          173 non-null    int64
 19  Non_college_jobs      173 non-null    int64
 20  Low_wage_jobs         173 non-null    int64
dtypes: float64(5), int64(14), object(2)
memory usage: 28.5+ KB

In [13]:
df.describe()

,Rank,Major_code,Total,Men,Women,ShareWomen,Sample_size,Employed,Full_time,Part_time,Full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th,College_jobs,Non_college_jobs,Low_wage_jobs
count,173.000000,173.000000,172.000000,172.000000,172.000000,172.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000,173.000000
mean,87.000000,3879.815029,39370.081395,16723.406977,22646.674419,0.522223,356.080925,31192.763006,26029.306358,8832.398844,19694.427746,2416.329480,0.068191,40151.445087,29501.445087,51494.219653,12322.635838,13284.497110,3859.017341
std,50.084928,1687.753140,63483.491009,28122.433474,41057.330740,0.231205,618.361022,50675.002241,42869.655092,14648.179473,33160.941514,4112.803148,0.030331,11470.181802,9166.005235,14906.279740,21299.868863,23789.655363,6944.998579
min,1.000000,1100.000000,124.000000,119.000000,0.000000,0.000000,2.000000,0.000000,111.000000,0.000000,111.000000,0.000000,0.000000,22000.000000,18500.000000,22000.000000,0.000000,0.000000,0.000000
25%,44.000000,2403.000000,4549.750000,2177.500000,1778.250000,0.336026,39.000000,3608.000000,3154.000000,1030.000000,2453.000000,304.000000,0.050306,33000.000000,24000.000000,42000.000000,1675.000000,1591.000000,340.000000
50%,87.000000,3608.000000,15104.000000,5434.000000,8386.500000,0.534024,130.000000,11797.000000,10048.000000,3299.000000,7413.000000,893.000000,0.067961,36000.000000,27000.000000,47000.000000,4390.000000,4595.000000,1231.000000
75%,130.000000,5503.000000,38909.750000,14631.000000,22553.750000,0.703299,338.000000,31433.000000,25147.000000,9948.000000,16891.000000,2393.000000,0.087557,45000.000000,33000.000000,60000.000000,14444.000000,11783.000000,3466.000000
max,173.000000,6403.000000,393735.000000,173809.000000,307087.000000,0.968954,4212.000000,307933.000000,251540.000000,115172.000000,199897.000000,28169.000000,0.177226,110000.000000,95000.000000,125000.000000,151643.000000,148395.000000,48207.000000

In [14]:
df.describe(include='object')

                        Major Major_category
count                     173            173
unique                    173             16
top     PETROLEUM ENGINEERING    Engineering
freq                        1             29

### Methods for categorical Columns

In [16]:
df['Major_category'].unique()

array(['Engineering', 'Business', 'Physical Sciences',
       'Law & Public Policy', 'Computers & Mathematics',
       'Agriculture & Natural Resources',
       'Industrial Arts & Consumer Services', 'Arts', 'Health',
       'Social Science', 'Biology & Life Science', 'Education',
       'Humanities & Liberal Arts', 'Psychology & Social Work',
       'Communications & Journalism', 'Interdisciplinary'], dtype=object)

In [17]:
df['Major_category'].value_counts()

Major_category
Engineering                            29
Education                              16
Humanities & Liberal Arts              15
Biology & Life Science                 14
Business                               13
Health                                 12
Computers & Mathematics                11
Physical Sciences                      10
Agriculture & Natural Resources        10
Social Science                          9
Psychology & Social Work                9
Arts                                    8
Industrial Arts & Consumer Services     7
Law & Public Policy                     5
Communications & Journalism             4
Interdisciplinary                       1
Name: count, dtype: int64

In [18]:
df['Major_category'].nunique()

16

## Practice Questions Part 1: 
- Step 1. Import the necessary libraries.
- Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/u.user)
- Step 3. Assign it to a variable called users and use the `user_id` as index
- Step 4. See the first 25 entries
- Step 5. See the last 10 entries
- Step 6. What is the number of observations in the dataset?
- Step 7. What is the number of columns in the dataset?
- Step 8. Print the name of all the columns.
- Step 9. How is the dataset indexed?
- Step 10. What is the data type of each column?
- Step 11. Print only the occupation column
- Step 12. How many different occupations are in this dataset?
- Step 13. What is the most frequent occupation?
- Step 14. Summarize the DataFrame.
- Step 15. Summarize all the columns
- Step 16. Summarize only the occupation column
- Step 17. What is the mean age of users?
- Step 18. What is the age with least occurrence?

In [20]:
import pandas as pd
# data reading
url = "https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/u.user"
users = pd.read_csv(url, delimiter="|")
users.head()

HTTPError: HTTP Error 404: Not Found

In [ ]:
# Task no 03
# First Method
users = pd.read_csv(url, delimiter="|", index_col='user_id')
users.head()


# Second method
# users.set_index('user_id')

In [ ]:
# Task no 04
users.head(25)

In [ ]:
# Task no 05
users.tail(10)

In [ ]:
# Task no 06
users.shape
# or 
users.info()

In [ ]:
# Task no 07 & 08
print("users.shape : ",users.shape)
users.columns

In [ ]:
# Task no 09
users.index

In [ ]:
# Task no 10
users.dtypes
 
#     or 
# users.info()

In [ ]:
# Task no 11
users['occupation']

In [ ]:
# Task no 12
# First method
users['occupation'].unique()

In [ ]:
# Second method
users['occupation'].nunique()

In [ ]:
# Third method
users['occupation'].value_counts()

In [ ]:
# Task no 13
users['occupation'].value_counts()[0]

In [ ]:
# Task no 14
users.describe()

In [ ]:
# Task no 15
users.describe(include='all')

In [ ]:
# Task no 16
users['occupation'].describe()

In [ ]:
# Task no 17
users['age'].mean()

In [ ]:
# Task no 18
users['age'].min()

In [ ]:
# import pandas as pd
# pd.Series([])
# pd.DataFrame(dict)
# shape
# info() -> indices of columns, columns name, total null values, datatype of each column, range of indices
# dtypes -> return datatype of all columns
# describe() -> descriptive view dataset/dataframe (mean, max, min, std, count)
# head() -> top records/rows/indices
# tail() -> last 5 records
# unique()  -> all unique values in given column(it is invalid for continuous data)
# nunique() -> return count of unique values
# value_counts() -> return unique values along with their frequency

## Practice Questions Part 2:
- Step 1. Import the necessary libraries
- Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/Euro_2012_stats_TEAM.csv)
- Step 3. Assign it to a variable called `euro12`.
- Step 4. Select only the Goal column.
- Step 5. How many team participated in the Euro2012?(value_counts/shape)
- Step 6. What is the number of columns in the dataset?(shape/info)
- Step 7. View only the columns Team, Yellow Cards and Red Cards and assign them to a dataframe called discipline
- Step 8. Sort the teams by Red Cards, then to Yellow Cards(Hint: sort_values)
- Step 9. Calculate the mean Yellow Cards given per Team(Hint: round())
- Step 10. Filter teams that scored more than 6 goals
- Step 11. Select the teams that start with G(Hint : str.startswith('G'))
- Step 12. Select the first 7 columns and all the rows(Hint: iloc())
- Step 13. Select all columns except the last 3.(Hint: iloc())
- Step 14. Presents/shows only the Shooting Accuracy from England, Italy and Russia

In [ ]:
!ls datasets/

In [21]:
import pandas as pd

file_path = "datasets/Euro_2012_stats_TEAM.csv"
euro12 = pd.read_csv(file_path)

In [22]:
euro12.head()

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,13,81.3%,41,62,2,9,0,9,9,16
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,9,60.1%,53,73,8,7,0,11,11,19
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,10,66.7%,25,38,8,4,0,7,7,15
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,22,88.1%,43,45,6,5,0,11,11,16
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,6,54.6%,36,51,5,6,0,11,11,19

In [ ]:
euro12.tail()

In [ ]:
euro12.shape

In [ ]:
euro12['Goals']

In [ ]:
euro12['Team'].shape # get total teams in the df

In [ ]:
euro12['Team'].value_counts()

In [ ]:
euro12.shape # total columns in the dataframe are 35

In [ ]:
# or 
euro12.info()

In [ ]:
# To access one column of data frame, we use the subscript operator ['col1']
# To access multiple columns of the data frame, we use a list of columns in subscript operator df[['col1', 'col2', 'col3']]

In [23]:
discipline = euro12[['Team','Yellow Cards','Red Cards']]
discipline

                   Team  Yellow Cards  Red Cards
0               Croatia             9          0
1        Czech Republic             7          0
2               Denmark             4          0
3               England             5          0
4                France             6          0
5               Germany             4          0
6                Greece             9          1
7                 Italy            16          0
8           Netherlands             5          0
9                Poland             7          1
10             Portugal            12          0
11  Republic of Ireland             6          1
12               Russia             6          0
13                Spain            11          0
14               Sweden             7          0
15              Ukraine             5          0

### Sort Method in Dataframe

#### Sorting dataframes using `df.sort_values()`

>Pandas data frame has two useful functions. **`df.sort_values()`** to sort by values of one or more columns and **`df.sort_index()`** to sort by the index. Each of these functions come with numerous options, like sorting in specific order (ascending or descending), sorting in place, sorting with missing values, sorting by specific algorithm etc.
- The `df.sort_values()` function sort by the values along either axis.
```
df.sort_values(by,axis=0,ascending=True,inplace=False,kind='quicksort',na_position='last',ignore_index=False)
```
Where,
-  `by`: str or list of str to sort
-  `axis`: If `axis` is 0 or 'index' then 'by' may contain index levels and/or column labels. If `axis` is 1 or 'columns' then 'by' may contain column levels and/or index labels.
- `ascending`: if True then ascending and if False then descending
- `inplace`:  If True, perform operation in-place.
- `kind`: {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'. This option is only applied when sorting on a single column or label.
- `na_position`: If first then puts NaNs at the beginning. Default is last
- `ignore_index`: If True, the resulting axis will be labeled 0, 1, …, n - 1. Default False

In [24]:
d1 = discipline.sort_values('Red Cards') # firstly sort by Red Cards
d1

                   Team  Yellow Cards  Red Cards
0               Croatia             9          0
1        Czech Republic             7          0
2               Denmark             4          0
3               England             5          0
4                France             6          0
5               Germany             4          0
7                 Italy            16          0
8           Netherlands             5          0
10             Portugal            12          0
12               Russia             6          0
13                Spain            11          0
14               Sweden             7          0
15              Ukraine             5          0
6                Greece             9          1
9                Poland             7          1
11  Republic of Ireland             6          1

In [25]:
d2 = d1.sort_values('Yellow Cards')
d2

                   Team  Yellow Cards  Red Cards
2               Denmark             4          0
5               Germany             4          0
3               England             5          0
8           Netherlands             5          0
15              Ukraine             5          0
4                France             6          0
12               Russia             6          0
11  Republic of Ireland             6          1
1        Czech Republic             7          0
14               Sweden             7          0
9                Poland             7          1
0               Croatia             9          0
6                Greece             9          1
13                Spain            11          0
10             Portugal            12          0
7                 Italy            16          0

In [26]:
#  Or
discipline.sort_values(by =['Red Cards','Yellow Cards'], inplace=True)

/var/folders/qb/lf_2q09x7wj115gvfnkv6tkm0000gn/T/ipykernel_70205/2009024054.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  discipline.sort_values(by =['Red Cards','Yellow Cards'], inplace=True)

In [27]:
discipline

                   Team  Yellow Cards  Red Cards
2               Denmark             4          0
5               Germany             4          0
3               England             5          0
8           Netherlands             5          0
15              Ukraine             5          0
4                France             6          0
12               Russia             6          0
1        Czech Republic             7          0
14               Sweden             7          0
0               Croatia             9          0
13                Spain            11          0
10             Portugal            12          0
7                 Italy            16          0
11  Republic of Ireland             6          1
9                Poland             7          1
6                Greece             9          1

#### Sorting dataframes using `df.sort_index()`
> We have observed while using `df.sort_values()`, by default the sorting is performed in the vertical direction. If you want to sort in the row direction, we can set the`axis` argument of  `df.sort_values()` method to 1, which is by default set to zero. However, it may cause problems when a number and a string are mixed

- So to sort a dataframe in the horizontal direction, we normally use **`df.sort_index()`** method.
```
df.sort_index(axis=0,ascending=True,inplace=False,kind='quicksort',na_position='last',ignore_index=False)
```
Where,
-  `axis`: The axis along which to sort. The value 0 identifies the rows, and 1 identifies the columns. (default is 0)
- `ascending`: If True then ascending and If False then descending
- `inplace`:  If True, perform operation in-place.
- `kind`: {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'. This option is only applied when sorting on a single column or label.
- `na_position`: If first then puts NaNs at the beginning. Default is last
- `ignore_index`: If True, the resulting axis will be labeled 0, 1, …, n - 1. Default False

In [28]:
discipline.sort_index(axis=0, ascending=True, ignore_index=True)

                   Team  Yellow Cards  Red Cards
0               Croatia             9          0
1        Czech Republic             7          0
2               Denmark             4          0
3               England             5          0
4                France             6          0
5               Germany             4          0
6                Greece             9          1
7                 Italy            16          0
8           Netherlands             5          0
9                Poland             7          1
10             Portugal            12          0
11  Republic of Ireland             6          1
12               Russia             6          0
13                Spain            11          0
14               Sweden             7          0
15              Ukraine             5          0

In [29]:
discipline['Yellow Cards'].mean()

np.float64(7.4375)

In [30]:
round(discipline['Yellow Cards'].mean(),2)

np.float64(7.44)

In [31]:
euro12.head()

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,13,81.3%,41,62,2,9,0,9,9,16
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,9,60.1%,53,73,8,7,0,11,11,19
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,10,66.7%,25,38,8,4,0,7,7,15
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,22,88.1%,43,45,6,5,0,11,11,16
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,6,54.6%,36,51,5,6,0,11,11,19

###  Conditional Selection
- Suppose we want to select only those rows where the Goals value is greater than 6.

**First Method**

In [32]:
euro12

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,13,81.3%,41,62,2,9,0,9,9,16
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,9,60.1%,53,73,8,7,0,11,11,19
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,10,66.7%,25,38,8,4,0,7,7,15
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,22,88.1%,43,45,6,5,0,11,11,16
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,6,54.6%,36,51,5,6,0,11,11,19
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,13,65.1%,67,48,12,9,1,12,12,20
7,Italy,6,34,45,43.0%,7.5%,110,2,0,0,...,20,74.1%,101,89,16,16,0,18,18,19
8,Netherlands,2,12,36,25.0%,4.1%,60,2,0,0,...,12,70.6%,35,30,3,5,0,7,7,15
9,Poland,2,15,23,39.4%,5.2%,48,0,0,0,...,6,66.7%,48,56,3,7,1,7,7,17
10,Portugal,6,22,42,34.3%,9.3%,82,6,0,0,...,10,71.5%,73,90,10,12,0,14,14,16
11,Republic of Ireland,1,7,12,36.8%,5.2%,28,0,0,0,...,17,65.4%,43,51,11,6,1,10,10,17
12,Russia,5,9,31,22.5%,12.5%,59,2,0,0,...,10,77.0%,34,43,4,6,0,7,7,16
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,15,93.8%,102,83,19,11,0,17,17,18
14,Sweden,5,17,19,47.2%,13.8%,39,3,0,0,...,8,61.6%,35,51,7,7,0,9,9,18
15,Ukraine,2,7,26,21.2%,6.0%,38,0,0,0,...,13,76.5%,48,31,4,5,0,9,9,18

In [33]:
mask = euro12['Goals'] > 6

In [34]:
mask

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15    False
Name: Goals, dtype: bool

In [35]:
euro12[mask]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,15,93.8%,102,83,19,11,0,17,17,18

**Second Method**

In [36]:
euro12['Goals'] > 6

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15    False
Name: Goals, dtype: bool

In [37]:
euro12[euro12['Goals'] > 6] #  euro12['Goals'] > 6 returns a series of true and false

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,15,93.8%,102,83,19,11,0,17,17,18

#### Get All Teams , name start with G

In [38]:
euro12['Team'].str.upper()

0                 CROATIA
1          CZECH REPUBLIC
2                 DENMARK
3                 ENGLAND
4                  FRANCE
5                 GERMANY
6                  GREECE
7                   ITALY
8             NETHERLANDS
9                  POLAND
10               PORTUGAL
11    REPUBLIC OF IRELAND
12                 RUSSIA
13                  SPAIN
14                 SWEDEN
15                UKRAINE
Name: Team, dtype: object

In [39]:
mask = euro12['Team'].str.startswith('G')
mask

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
Name: Team, dtype: bool

In [40]:
euro12[mask]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,13,65.1%,67,48,12,9,1,12,12,20

### Task: Remove spaces and special characters from column names

In [ ]:
euro12.columns.str.replace(" ", "_").str.replace("%","").str.replace(".", "")

In [ ]:
euro12.iloc[:,:7]

In [ ]:
euro12.iloc[:,-3:]

In [ ]:
# # euro12.loc[), ['Team','Shooting Accuracy']]
euro12.loc[euro12.Team.isin(['England', 'Italy', 'Russia']), ['Team','Shooting Accuracy']]

## All statistical functions
- `count()` : Returns the number of times an element/data has occurred (non-null)
- `sum()`	: Returns sum of all values
- `mean()` : Returns the average of all values
- `median()` : Returns the median of all values
- `mode()` : Returns the mode
- `std()`	: Returns the standard deviation
- `min()`	: Returns the minimum of all values
- `max()`	: Returns the maximum of all values
- `abs()`	: Returns the absolute value

In [41]:
print("Total number of elements in each column of dataframe ")
df.count()

Total number of elements in each column of dataframe

Rank                    173
Major_code              173
Major                   173
Total                   172
Men                     172
Women                   172
Major_category          173
ShareWomen              172
Sample_size             173
Employed                173
Full_time               173
Part_time               173
Full_time_year_round    173
Unemployed              173
Unemployment_rate       173
Median                  173
P25th                   173
P75th                   173
College_jobs            173
Non_college_jobs        173
Low_wage_jobs           173
dtype: int64

In [44]:
df['Total'].count()

np.int64(172)

In [45]:
df.sum(numeric_only=True)

Rank                    1.505100e+04
Major_code              6.712080e+05
Total                   6.771654e+06
Men                     2.876426e+06
Women                   3.895228e+06
ShareWomen              8.982242e+01
Sample_size             6.160200e+04
Employed                5.396348e+06
Full_time               4.503070e+06
Part_time               1.528005e+06
Full_time_year_round    3.407136e+06
Unemployed              4.180250e+05
Unemployment_rate       1.179701e+01
Median                  6.946200e+06
P25th                   5.103750e+06
P75th                   8.908500e+06
College_jobs            2.131816e+06
Non_college_jobs        2.298218e+06
Low_wage_jobs           6.676100e+05
dtype: float64

## Input and Output

- Often, you won’t be creating data but will be having it in some form, and you would want to import it to run your analysis on it. Fortunately, Pandas allows you to do this. Not only does it help in importing data, but you can also save your data in your desired format using Pandas.
- The below table shows the formats supported by Pandas, the function to read files using Pandas, and the function to write files.
|Input |type      |	Reader	Writer |
|------|----------|----------------|
|CSV   |read_csv  |  to_csv        |
|JSON  |read_json | to_json
|HTML  |read_html |to_html
|Excel |read_excel|to_excel
|SAS   |read_sas  |–
|Python|Pickle    |	read_pickle	to_pickle
|SQL   |read_sql  |to_sql
|Google|Big Query | read_gbq	to_gbq

In [46]:
# Save a dataframe to CSV File
data = {'Name':['Captain America', 'Iron Man', 'Hulk', 'Thor','Black Panther'],
        'Rating':[100, 80, 84, 93, 90],
        'Place':['USA','USA','USA','Asgard','Wakanda']}

In [47]:
data

{'Name': ['Captain America', 'Iron Man', 'Hulk', 'Thor', 'Black Panther'],
 'Rating': [100, 80, 84, 93, 90],
 'Place': ['USA', 'USA', 'USA', 'Asgard', 'Wakanda']}

In [48]:
# Create dataframe from above dictionary
import pandas as pd
df = pd.DataFrame(data)
df

              Name  Rating    Place
0  Captain America     100      USA
1         Iron Man      80      USA
2             Hulk      84      USA
3             Thor      93   Asgard
4    Black Panther      90  Wakanda

In [ ]:
!ls datasets/

In [ ]:
df.to_csv("datasets/avengers1.csv")

In [ ]:
!cat datasets/avengers1.csv

## Aggregation
- The aggregation function can be applied against a single or more column. You can either apply the same aggregate function across various columns or different aggregate functions across various columns.
- Syntax : 
 >- DataFrame.aggregate(self, func, axis=0, *args, ***kwargs)
 
<img src="images/pandas-agg-func.png" height=400px width=600px>

In [49]:
data_url = 'http://bit.ly/2cLzoxH'
data_url

'http://bit.ly/2cLzoxH'

In [50]:
# read data from url as pandas dataframe
gapminder = pd.read_csv(data_url)
gapminder.head(3)

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710

In [51]:
gapminder[gapminder['country'] == 'Pakistan']

       country  year          pop continent  lifeExp    gdpPercap
1164  Pakistan  1952   41346560.0      Asia   43.436   684.597144
1165  Pakistan  1957   46679944.0      Asia   45.557   747.083529
1166  Pakistan  1962   53100671.0      Asia   47.670   803.342742
1167  Pakistan  1967   60641899.0      Asia   49.800   942.408259
1168  Pakistan  1972   69325921.0      Asia   51.929  1049.938981
1169  Pakistan  1977   78152686.0      Asia   54.043  1175.921193
1170  Pakistan  1982   91462088.0      Asia   56.158  1443.429832
1171  Pakistan  1987  105186881.0      Asia   58.245  1704.686583
1172  Pakistan  1992  120065004.0      Asia   60.838  1971.829464
1173  Pakistan  1997  135564834.0      Asia   61.818  2049.350521
1174  Pakistan  2002  153403524.0      Asia   63.610  2092.712441
1175  Pakistan  2007  169270617.0      Asia   65.483  2605.947580

In [52]:
gapminder['continent'].value_counts()

continent
Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: count, dtype: int64

In [53]:
gapminder_data = gapminder[['continent','pop']]
gapminder_data.head()
# gapminder.head()

  continent         pop
0      Asia   8425333.0
1      Asia   9240934.0
2      Asia  10267083.0
3      Asia  11537966.0
4      Asia  13079460.0

In [54]:
# Using Aggregate Functions on Series
mean  = gapminder_data['pop'].aggregate('mean')
print("Mean of population : ", mean)

Min  = gapminder_data['pop'].aggregate('min')
print("Minimum value of population : ", Min)

Max  = gapminder_data['pop'].aggregate('max')
print("Maximum value of population : ", Max)

Std  = gapminder_data['pop'].aggregate('std')
print("Std of population : ", Std)

Mean of population :  29601212.32511736
Minimum value of population :  60011.0
Maximum value of population :  1318683096.0
Std of population :  106157896.74682792

In [55]:
# Using multiple Aggregate Functions on Dataframe
gapminder_data['pop'].aggregate(['sum','min','max'])

sum    5.044047e+10
min    6.001100e+04
max    1.318683e+09
Name: pop, dtype: float64

In [56]:
# Using multiple Aggregate Functions on Multiple columns of Dataframe
gapminder[['pop','lifeExp']].aggregate(['sum','min','max','std','mean','var'])

               pop        lifeExp
sum   5.044047e+10  101344.444680
min   6.001100e+04      23.599000
max   1.318683e+09      82.603000
std   1.061579e+08      12.917107
mean  2.960121e+07      59.474439
var   1.126950e+16     166.851664

In [57]:
# We can also perform above task by using below code
gapminder.aggregate({'pop':['sum','min','max'],
                    'lifeExp':['sum','min','max']})

              pop       lifeExp
sum  5.044047e+10  101344.44468
min  6.001100e+04      23.59900
max  1.318683e+09      82.60300

In [58]:
# df.describe()  gives overall descriptive view of our dataset
gapminder.describe()

             year           pop      lifeExp      gdpPercap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [63]:
# import seaborn as sns 
# sns.boxplot(gapminder['gdpPercap'])

## Groupby
- Pandas groupby function is used to split the DataFrame into groups based on some criteria. 
- Similar to the `SQL GROUP BY` clause pandas `DataFrame.groupby()` function is used to collect the identical data into groups and perform aggregate functions on the grouped data. Group by operation involves splitting the data, applying some functions, and finally aggregating the results.

<img src="images/pandas-groupby-standard-dev.png.webp" height=500px width=500px>
<img src="images/groupby-example.png" height=700px width=700px>

### Syntax of Pandas DataFrame.groupby()

       
       `DataFrame.groupby(by=None, axis=0, level=None, as_index=True,     
       sort=True, group_keys=True, squeeze=<no_default>,      
       observed=False, dropna=True)`
       
       
- `by` – List of column names to group by
- `axis` – Default to 0. It takes 0 or ‘index’, 1 or ‘columns’
- `level` – Used with MultiIndex.
- `as_index` – sql style grouped otput.
- `sort` – Default to True. Specify whether to sort after group
- `group_keys` – add group keys or not
- `squeeze` – depricated in new versions
- `observed` – This only applies if any of the groupers are Categoricals.
- `dropna` – Default to False. Use True to drop None/Nan on sory key.

In [65]:
import numpy as np

In [66]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python",np.nan],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8      NaN   1500   40days       0.0

#### Use groupby() to compute the sum of Fee and Discount of each course

In [67]:
df.groupby(['Courses']).sum()

           Fee      Duration  Discount
Courses
Hadoop   48000  55days35days    1000.0
Pandas   26000        60days    2500.0
PySpark  25000        50days    2300.0
Python   46000  40days50days    2800.0
Spark    47000  30days30days    2400.0

In [68]:
# method 2
df.groupby(['Courses'])[['Fee','Discount']].sum()

           Fee  Discount
Courses
Hadoop   48000    1000.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

In [69]:
# similarly
df.groupby(['Courses']).aggregate('sum')

           Fee      Duration  Discount
Courses
Hadoop   48000  55days35days    1000.0
Pandas   26000        60days    2500.0
PySpark  25000        50days    2300.0
Python   46000  40days50days    2800.0
Spark    47000  30days30days    2400.0

#### pandas groupby() on Two or More Columns like Courses and Duration

In [72]:
df1 = df.groupby(['Courses','Duration']).mean()

In [75]:
df1

                      Fee  Discount
Courses Duration
Hadoop  35days    25000.0       NaN
        55days    23000.0    1000.0
Pandas  60days    26000.0    2500.0
PySpark 50days    25000.0    2300.0
Python  40days    24000.0    1200.0
        50days    22000.0    1600.0
Spark   30days    23500.0    1200.0

In [74]:
df1.index

MultiIndex([( 'Hadoop', '35days'),
            ( 'Hadoop', '55days'),
            ( 'Pandas', '60days'),
            ('PySpark', '50days'),
            ( 'Python', '40days'),
            ( 'Python', '50days'),
            (  'Spark', '30days')],
           names=['Courses', 'Duration'])

#### Add Index to the grouped data
- By default `groupby()` result doesn’t include row Index, you can add the index using `DataFrame.reset_index()` method.

In [71]:
df.groupby(['Courses','Duration']).mean().reset_index()

   Courses Duration      Fee  Discount
0   Hadoop   35days  25000.0       NaN
1   Hadoop   55days  23000.0    1000.0
2   Pandas   60days  26000.0    2500.0
3  PySpark   50days  25000.0    2300.0
4   Python   40days  24000.0    1200.0
5   Python   50days  22000.0    1600.0
6    Spark   30days  23500.0    1200.0

#### Remove sorting on grouped results by using `sort` parameter of df.groupby()

In [76]:
df2=df.groupby(by=['Courses'], sort=False).sum()
df2

           Fee      Duration  Discount
Courses
Spark    47000  30days30days    2400.0
PySpark  25000        50days    2300.0
Hadoop   48000  55days35days    1000.0
Python   46000  40days50days    2800.0
Pandas   26000        60days    2500.0

#### Apply More Aggregations
- You can also compute several aggregations at the same time in pandas by passing the list of agg functions to the `aggregate().`

#### Compute minimu and maximum fee of each course

In [ ]:
df.groupby('Courses')['Fee'].aggregate(['min','max'])

In [ ]:
# Groupby multiple columns & multiple aggregations
df.groupby('Courses').aggregate({'Duration':'count',
                                'Fee':['min','max']})

## Practice Questions

### Regiment
- A regiment is a military unit. Its role and size varies markedly, depending on the country, service and/or a specialisation.

#### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd

#### Step 2. Create the DataFrame with the following values and Assign it to a variable called regiment.

In [ ]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
regiment = pd.DataFrame(raw_data)
regiment

#### Step 3. What is the mean `preTestScore` from the regiment `Nighthawks`(Nightbird/Night owl)?

In [ ]:
# First Method
regiment[regiment['regiment'] == 'Nighthawks'].describe()

In [ ]:
regiment[regiment['regiment'] == 'Nighthawks']['preTestScore']

In [ ]:
# Second Method
regiment[regiment['regiment'] == 'Nighthawks']['preTestScore'].mean()

In [ ]:
# regiment[regiment['regiment'] == 'Nighthawks']

# 3rd Method
regiment.groupby('regiment').mean()

In [ ]:
regiment.groupby('regiment').get_group('Nighthawks')['preTestScore'].mean()

#### Step 4. Present/show general statistics by `company` of regiment.

In [ ]:
# regiment.groupby('company').describe()

regiment.groupby('company').describe()

#### Step 5. What is the mean of each company's preTestScore?

In [ ]:
regiment.groupby('company')['preTestScore'].mean()

In [ ]:
# regiment.groupby('company')['preTestScore'].mean()

# OR

regiment.groupby('company').mean()

#### Step 6. Presents/shows the `mean` preTestScores grouped by regiment and company.

In [ ]:
regiment.groupby(['regiment','company'])['preTestScore'].mean()

In [ ]:
# regiment.groupby(['regiment','company'])['preTestScore'].mean()
# OR
regiment.groupby(['regiment', 'company']).preTestScore.mean().unstack()

#### Step 7. Presents/shows the `mean` preTestScores grouped by regiment and company with reset_index parameter

In [ ]:
regiment.groupby(['regiment', 'company'])['preTestScore'].mean().reset_index()

#### Step 8. Group the entire dataframe by regiment and company , also perform `sum` aggregate function.

In [ ]:
regiment.groupby(['regiment','company']).sum()

#### Step 9. What is the number of observations in each regiment and company.

In [ ]:
regiment.groupby(['regiment','company']).size()
# OR 
regiment.groupby(['regiment','company']).count()

#### Step 10. Iterate over a group and print the name and the whole data from the regiment

In [ ]:
for name, data in regiment.groupby('regiment'):
    print("Group Name :", name)
    print("Group Data : ", data,sep="\n")

## Merging, Joining and Concatenation
Before I start with Pandas join and merge functions, let me introduce you to four different types of joins, they are inner join, left join, right join, outer join.
<img src="images/Untitled.png" height=500px width=500px align="right"> 

- **Full outer join**: Combines results from both DataFrames. The result will have all columns from both DataFrames.
- **Inner join**: Only those rows which are present in both DataFrame A and DataFrame B will be present in the output.
- **Right join**: Right join uses all records from DataFrame B and matching records from DataFrame A.
- **Left join**: Left join uses all records from DataFrame A and matching records from DataFrame B.

<img src="images/joins.png" height=600px width=600px align="left" >

### Merging
- Merging a Dataframe with one unique key.

#### Syntax:
```
pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
left_index=False, right_index=False, sort=True)
``` 
- `left` − A DataFrame object.
- `right` − Another DataFrame object.
- `on` − Columns (names) to join on. Must be found in both the left and right DataFrame objects.
- `left_on` − Columns from the left DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.
- `right_on` − Columns from the right DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.
- `left_index` − If True, use the index (row labels) from the left DataFrame as its join key(s). In case of a DataFrame with a MultiIndex (hierarchical), the number of levels must match the number of join keys from the right DataFrame.
- `right_index` − Same usage as left_index for the right DataFrame.
- `how` − One of 'left', 'right', 'outer', 'inner'. Defaults to inner. Each method has been described below.
- `sort` − Sort the result DataFrame by the join keys in lexicographical order. Defaults to True, setting to False will improve the performance substantially in many cases.

In [ ]:
# Define a dictionary containing employee data 
import pandas as pd
data1 = {'key':['K0','K1','K2','K3'],
         'Name':['Mercy', 'Prince', 'John', 'Cena'],
         'Age':[27, 24, 22, 32],} 
# Define a dictionary containing employee data 

data2 = {'key':['K0','K1','K2','K3'],
         'Address':['Canada', 'UK', 'India', 'USA'], 
         'Qualification':['Btech', 'B.A', 'MS', 'Phd']}

In [ ]:


# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data1)
# Convert the dictionary into DataFrame  
df2 = pd.DataFrame(data2) 

df1

In [ ]:
df2

In [ ]:
# merging of two dataframes on basis ok `key` 
final_df = pd.merge(df1, df2, on='key')
final_df

#### Merging Dataframe using multiple keys.

In [ ]:
# Define a dictionary containing employee data 

data1 = {'key':['K0','K1','K2','K3'],
         'Name':['Mercy', 'Prince', 'John', 'Cena'],
          'Address':['Canada', 'Australia', 'India', 'Japan'],
         'Age':[27, 24, 22, 32],} 
# Define a dictionary containing employee data 

data2 = {'key':['K0','K1','K2','K3'],
         'Address':['Canada', 'UK', 'India', 'USA'], 
         'Qualification':['Btech', 'B.A', 'MS', 'Phd']} 

# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data1)
# Convert the dictionary into DataFrame  
df2 = pd.DataFrame(data2) 

df1.Address, df2.Address

In [ ]:
# merging of two dataframes on basis ok `key` 
final_df = pd.merge(df1, df2, on=['key','Address'])
final_df

#### Left merge
- In pd.merge() I pass the argument `how = left` to perform a left merge.

In [ ]:
# Define a dictionary containing employee data 

data1 = {'key':['K0','K1','K2','K3'],
         'Name':['Mercy', 'Prince', 'John', 'Cena'],
          'Address':['Canada', 'Australia', 'India', 'Japan'],
         'Age':[27, 24, 22, 32],} 
# Define a dictionary containing employee data 

data2 = {'key':['K0','K1','K2','K3'],
         'Address':['Canada', 'UK', 'India', 'USA'], 
         'Qualification':['Btech', 'B.A', 'MS', 'Phd']} 

# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data1)
# Convert the dictionary into DataFrame  
df2 = pd.DataFrame(data2) 

df1

In [ ]:
df2

In [ ]:
# merging of two dataframes on basis ok `key` 
final_df = pd.merge(df1, df2, on=['key','Address'], how='left')
final_df

#### Right merge
- In pd.merge() I pass the argument `how = right` to perform a left merge.

In [ ]:
# Define a dictionary containing employee data 

data1 = {'key':['K0','K1','K2','K3'],
         'Name':['Mercy', 'Prince', 'John', 'Cena'],
          'Address':['Canada', 'Australia', 'India', 'Japan'],
         'Age':[27, 24, 22, 32],} 
# Define a dictionary containing employee data 

data2 = {'key':['K0','K1','K2','K3'],
         'Address':['Canada', 'UK', 'India', 'USA'], 
         'Qualification':['Btech', 'B.A', 'MS', 'Phd']} 

# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data1)
# Convert the dictionary into DataFrame  
df2 = pd.DataFrame(data2) 
df1

In [ ]:
df2

In [ ]:

# merging of two dataframes on basis ok `key` 
final_df = pd.merge(df1, df2, on=['key','Address'], how='right')
final_df

#### Outer Merge
- In pd.merge(), I pass the argument `how = outer` to perform a outer merge.

In [ ]:
# Define a dictionary containing employee data 

data1 = {'key':['K0','K1','K2','K3'],
         'Name':['Mercy', 'Prince', 'John', 'Cena'],
          'Address':['Canada', 'Australia', 'India', 'Japan'],
         'Age':[27, 24, 22, 32],} 
# Define a dictionary containing employee data 

data2 = {'key':['K0','K1','K2','K3'],
         'Address':['Canada', 'UK', 'India', 'USA'], 
         'Qualification':['Btech', 'B.A', 'MS', 'Phd']} 

# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data1)
# Convert the dictionary into DataFrame  
df2 = pd.DataFrame(data2) 
df1

In [ ]:
df2

In [ ]:

# merging of two dataframes on basis ok `key` 
final_df = pd.merge(df1, df2, on=['key','Address'], how='outer')
final_df

## Join
- Join is used to combine DataFrames having different indcies values.
- `I have two different tables in Python but I’m not sure how to join them. What criteria should I consider? What are the different ways I can join these tables?`
- Sound familiar? I have come across this question plenty of times on online discussion forums. Working with one table is fairly straightforward but things become challenging when we have data spread across two or more tables.
- This is where the concept of Joins comes in. I cannot emphasize the number of times I have used these Joins in Pandas! They’ve come in especially handy during data science hackathons when I needed to quickly join multiple tables.

In [ ]:
df1.join(df2, on = ['key','Address'])

#### Understanding the Problem Statement

- I’m sure you’re quite familiar with e-commerce sites like `Amazon` and `Flipkart` these days. We are bombarded by their advertisements when we’re visiting non-related websites – that’s the power of targeted marketing!
- We’ll take a simple problem from a related marketing brand here. We are given two tables – one which contains data about products and the other that has customer-level information.
- We will use these tables to understand how the different types of joins work using Pandas.

#### Note: 
 >- Our task is to use our joining skills and generate meaningful information from the data.

In [ ]:
# The product dataframe contains product details like Product_ID, Product_name, Category, Price, and Seller_City. 
product=pd.DataFrame({
    'Product_ID':[101,102,103,104,105,106,107],
    'Product_name':['Watch','Bag','Shoes','Smartphone','Books','Oil','Laptop'],
    'Category':['Fashion','Fashion','Fashion','Electronics','Study','Grocery','Electronics'],
    'Price':[299.0,1350.50,2999.0,14999.0,145.0,110.0,79999.0],
    'Seller_City':['Delhi','Mumbai','Chennai','Kolkata','Delhi','Chennai','Bengalore']
})

# The customer dataframe contains details like id, name, age, Product_ID, Purchased_Product, and City.
customer=pd.DataFrame({
    'id':[1,2,3,4,5,6,7,8,9],
    'name':['Olivia','Aditya','Cory','Isabell','Dominic','Tyler','Samuel','Daniel','Jeremy'],
    'age':[20,25,15,10,30,65,35,18,23],
    'Product_ID':[101,0,106,0,103,104,0,0,107],
    'Purchased_Product':['Watch','NA','Oil','NA','Shoes','Smartphone','NA','NA','Laptop'],
    'City':['Mumbai','Delhi','Bangalore','Chennai','Chennai','Delhi','Kolkata','Delhi','Mumbai']
})

- Let’s say we want to know about all the products sold online and who purchased them. We can get this easily using an inner join.

- The `merge()` function in Pandas is our friend here. By default, the merge function performs an inner join. It takes both the dataframes as arguments and the name of the column on which the join has to be performed:

In [ ]:
product

In [ ]:
customer

In [ ]:
pd.merge(product, customer, on='Product_ID')

- Here, I have performed inner join on the product and customer dataframes on the `Product_ID` column.
- But, what if the column names are different in the two dataframes? Then, we have to explicitly mention both the column names.
- `left_on` and `right_on` are two arguments through which we can achieve this. `left_on` is the name of the key in the left dataframe and `right_on` in the right dataframe

In [ ]:
pd.merge(product, customer, left_on='Product_name', right_on='Purchased_Product')

- Let’s take things up a notice. The leadership team now wants more details about the products sold. They want to know about all the products sold by the seller to the same city i.e., seller and customer both belong to the same city.

- In this case, we have to perform an inner join on both Product_ID and Seller_City of product and Product_ID and City columns of the customer dataframe.

In [ ]:
pd.merge(product, customer, left_on=['Product_ID', 'Seller_City'], right_on=['Product_ID','City'])

## Concatenation
Concatenating of two or more dataframes using `.concat()` function.

In [ ]:
print("First DataFrame : ", df1, sep="\n")
print("Second DataFrame : ", df2, sep="\n")

In [ ]:
frames = [df1, df2]
# concatenation using concate function
pd.concat(frames)

The resultant DataFrame has a repeated index. If you want the new Dataframe to have its own index, set `ignore_index` to True.

In [ ]:
frames = [df1, df2]
# concatenation using concate function
pd.concat(frames, ignore_index=True)

#### Note: 
 >- The second DataFrame is concatenating below the first one, making the resultant DataFrame have new rows. If you want the second DataFrame to be added as columns, pass the argument axis=1.

In [ ]:
frames = [df1, df2]
# concatenation using concate function
pd.concat(frames, axis=1,)

In [ ]:
pd.concat(frames, axis=1)

#### Note: 
 >- Here columns of resultant dataframes are repeated to avoid this, we will append() function.

### Concatenating using `.append()` function
- Append function concatenates along axis = 0 only. It can take multiple objects as input.

In [ ]:
df1.append(df2, ignore_index=True)

## Practices 
- Import pandas library.
- Download both datasets for this exercise from here [data1](https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/data1.csv) and [data2](https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/data2.csv)

### Step 1 : Write a program to join the two given dataframes along rows and assign all to variable `data`.

In [ ]:
data1 = pd.read_csv('datasets/data1.csv')
data2 = pd.read_csv('datasets/data2.csv')
print("First Data : ", data1, sep="\n")
print("Second Data : ", data2, sep="\n")
print("Joining of two dataframes along rows wise ...")
data = pd.concat([data1, data2],)
data

# pd.concat([df1,df2])

### Step 2 : Write a program to join the two given dataframes along columns and assign all to variable data.

In [ ]:
# data1 = pd.read_csv('datasets/data1.csv')
# data2 = pd.read_csv('datasets/data2.csv')
# # print("First Data : ", data1, sep="\n")
# # print("Second Data : ", data2, sep="\n")
# print("Joining of two dataframes along rows wise ...")
data = pd.concat([data1, data2],axis=1)
data

### Step 3 : Write a Pandas program to append rows to an existing DataFrame `data1` and display the combined data.

In [ ]:
s1 = pd.Series(['S6','Ehtisham Sadiq', 187], index=['student_id', 'name', 'marks'])
s1

In [ ]:
combined_data = data1.append(s1, ignore_index=True)
print("Combined data : ", combined_data, sep="\n")

#### Summary
- For `pandas.DataFrame`, both `join` and `merge` operates on columns and rename the common columns using the given suffix. In terms of row-wise alignment, `merge` provides more flexible control.
- Different from `join` and `merge`, `concat` can operate on columns or rows, depending on the given axis, and no renaming is performed. In addition, `concat` allows defining hierachy structures by passing in `keys` and `names`.

## How To Perform Data Visualization with Pandas

#### Introduction
- Data visualization is the most important step in the life cycle of data science, data analytics, or we can say in data engineering. It is more impressive, interesting and understanding when we represent our study or analysis with the help of colours and graphics. Using visualization elements like graphs, charts, maps, etc., it becomes easier for clients to understand the underlying structure, trends, patterns and relationships among variables within the dataset. Simply explaining the data summary and analysis using plain numbers becomes complicated for both, people coming from technical and non-technical backgrounds. Data visualization gives us a clear idea of what the data wants to convey to us. It makes data neutral for us to understand the data insights.
- Data visualization involves operating a huge amount of data and converts it into meaningful and knowledgeable visuals using various tools. For visualizing data we need the best software tools to handle various types of data in structured or unstructured format from different sources such as files, web API, databases, and many more. We must choose the best visualization tool that fulfils all our requirements. The tool should support interactive plots generation, connectivity to data sources, combining data sources, automatically refresh the data, secured access to data sources, and exporting widgets. All these features allow us to make the best visuals of our data and also save time.
#### Advantages of Data Visualization
<img src="images/70513benefits.jpg" height=600px width=600px >

### Data Visualization with Pandas:

- Pandas library in python is mainly used for data analysis. It is not a data visualization library but, we can create basic plots using Pandas. Pandas is highly useful and practical if we want to create exploratory data analysis plots. We do not need to import other data visualization libraries in addition to Pandas for such tasks.

- As Pandas is Python’s popular data analysis library, it provides several different functions to visualizing our data with the help of the .plot() function. There is one more advantage of using Pandas for visualization is we can serialize or create a pipeline of data analysis functions and plotting functions. It simplifies the task.

#### Creating of Dataframe

In [ ]:
x = pd.Series(np.arange(1,21))
y = x**1.2
z = x**1.7
w = x**.5

In [ ]:
dict1 = {'col1':x,
        'col2':y,
        'col3':z,
        'col4':w}
# dict1

In [ ]:
#importing packages
import numpy as np
import pandas as pd

#creating a DataFrame
df = pd.DataFrame(dict1)
# Since this is a randomly generated dataframe the values will differ everytime you run this code for everyone.

#displaying the DataFrame
df

#### Line plot:
- Line plot can be created with DataFrame.plot() function.

In [ ]:
df.plot()

We have got the well-versed line plot for `df` without specifying any type of features in the `.plot()` function. We can plot graphs between two columns also

In [ ]:
df.plot(x='col1', y='col4')

In [ ]:
df[['col3','col4']].plot()

In [ ]:
# We can also generate subplots for individual columns.
df.plot(subplots=True, figsize=(8,8))

### Bar plot:
- Now, we will create bar plots for the same dataframe. Bar plot can be created with `DataFrame.plot.bar()` function.

In [ ]:
df.plot.bar()

In [ ]:
df.plot.bar(stacked=True)
# In this bar plot, the bars are stacked.

In [ ]:
df.plot.barh(stacked=True)
# In this bar plot, the bars are stacked.

### Histogram Plot:
Now, let’s generate a histogram for the `df`. Histogram plot can be created with `DataFrame.plot.hist()` function.

In [ ]:
df.plot.hist()

In [ ]:
# Now, let’s create a histogram with some other features.
df.plot.hist(stacked=True, bins=15)
# This is a stacked histogram.

In [ ]:
df.plot.hist(orientation="horizontal", cumulative=True);
# Here, we have added a cumulative frequency in the histogram.

In [ ]:
# Let’s create a histogram for each column individually.
df.diff().hist(bins=15)

### Box Plot:
Now, we will create box plot. Box plot can be created with `DataFrame.plot.box()` function or `DataFrame.boxplot()`.

In [ ]:
# First Method    
df.plot.box()

In [ ]:
# Second Method
df.boxplot()

In [ ]:
# Now, generating the box plot in a horizontal form.
df.plot.box(vert=False)

### Area plot:
Now, we will create a area plot. Area plot can be created with `DataFrame.plot.area()` function. By default, it is stacked.

In [ ]:
df.plot.area()

In [ ]:
# Now, we will create unstacked area plot.
df.plot.area(stacked=False)

### Scatter plot:
Now, let’s generate a scatter plot. A Scatter plot can be created with `DataFrame.plot.scatter()` function. As we know scatter plot takes two-positional required arguments i.e. x and y to plot the graph. So, we will give the values of the  `x-axis` and `y-axis` as the name of columns.

In [ ]:
df.plot.scatter('col4', 'col3')

In [ ]:
# This is the scatter plot between col_1 and col_2 of dataframe df. Let’s apply some styles.
ax = df.plot.scatter('col1', 'col2', color='r', marker="*", s=100)
df.plot.scatter(x='col3',y='col4', color='b', s=100, ax=ax)

In this plot the data is spread with respect to col_2 and col_4 and the we have added some styles also like color, marker  and size of scatters. Let’s see another style of scatter plot

In [ ]:
df.plot.scatter(x='col2', y='col4', c='col1', s=100)
# The c keyword is given as the name of a column to provide colours for each point.

### Pie chart:
- A Pie plot can be created with `DataFrame.plot.pie()` function or `Series.plot.pie()`. To generate a pie chart we will create series data as a pie chart is created only for one column. Let’s create a series named pie.

In [ ]:
pie = pd.Series(np.random.randint(10,100,4))
pie

In [ ]:
pie.plot.pie()

In [ ]:
# Let's apply some styles
pie.plot.pie(autopct='%.2f')

### Pie Chart for DataFrame
- A Pie chart can be created for DataFrames  also but it will generate individual pies for each column of DataFrame in the form of subplots. Let’s Create a pie chart for the dataframe also

In [ ]:
new_df = pd.DataFrame(np.random.randint(20,100,(5,3)),columns=['col1','col2','col3'])
new_df

In [ ]:
new_df.plot.pie(subplots=True, figsize=(15,15), autopct='%.2f')

## Practice Exercise Part 1:
#### Visualizing the Titanic Disaster
- Step 1. Import the necessary libraries
- Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/train.csv)
- Step 3. Assign it to a variable titanic
- Step 4. Set PassengerId as the index
- Step 5. Create a pie chart presenting the male/female proportion
- Step 6. Create a scatterplot with the Fare payed and the Age, differ the plot color by gender
- Step 7. How many people survived and died , display using pie chart?
- Step 8. Create a histogram with the Fare payed.

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [ ]:
titanic.head()

In [ ]:
# titanic['sex'].value_counts().values
male = (titanic.sex == 'male').sum()
female = (titanic.sex == 'female').sum()

In [ ]:
gender_series = pd.Series([male, female])
gender_series

In [ ]:
gender_series.plot.pie(labels=['male','female'], autopct ="%.2f");

In [ ]:
sns.countplot(x=titanic['sex']);

In [ ]:
# url = "https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/train.csv"
# titanic = pd.read_csv(url,)

# # titanic = pd.read_csv(url,index_col='PassengerId')
# # titanic.head()
# # OR
# titanic.set_index('PassengerId').head()
# titanic.shape
# males = (titanic.Sex == 'male').sum()
# females = (titanic.Sex =='female').sum()
# print("Total Males : ", males)
# print("Total Females : ", females)
# new_titanic = pd.Series([males,females])
# new_titanic
# new_titanic.plot.pie(labels=['Male','Female'], autopct='%.2f')
# titanic.columns
# # titanic.head()
# list1 = []
# for i in titanic.Sex:
#     if i=='male':
#         list1.append(1)
#     else:
#         list1.append(0)
# titanic['new_Sex'] = list1
# titanic.head()
# titanic.plot.scatter(x='Fare',y='Age',c='new_Sex',s=10)
# titanic.Fare.min(), titanic.Fare.max(), titanic.Fare.mean()
# titanic.Fare.plot.hist(bins=20)

### Practice Exercise Part 2:
- Step 1. Import the necessary libraries
- Step 2. Import the dataset given below
- Step 3. Assign it to a variable `df3`
- Step 4. Create a scatter plot of `b` vs `a` by using `red` color.
- Step 5. Create a histogram of the `a` column.
- Step 6. Create a histogram of the `b` column and use bins=30.
- Step 7. Create a boxplot comparing the `a` and `b` columns.
- Step 8. Create a kde plot of the `d` column.
- Step 9. Create a kde plot of the `d` column and Figure out how to increase the linewidth and make the linestyle dashed. (Note: You would usually not dash a kde plot line)
- Step 10. Create an area plot of all the columns for just the rows up to 30. (hint: alpha=0.4)

In [ ]:
# df3 = pd.DataFrame(np.random.rand(500,4), columns=['a','b','c','d'])
# df3.head()

## Basic Python Pandas Exercise 
- In this exercise, we are using `Automobile Dataset` for data analysis. This Dataset has different characteristics of an auto such as body-style, wheel-base, engine-type, price, mileage, horsepower, etc.
- Download dataset from this link [Automobile data_set](https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/Automobile_data.csv)

In [ ]:
!ls datasets/

In [ ]:
# url= "https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/Automobile_data.csv"
import pandas as pd
file_path = "datasets/Automobile_data.csv"
automobile = pd.read_csv(file_path)
automobile.head()

In [ ]:
automobile.shape

In [ ]:
automobile.info()

In [ ]:
automobile.describe()

In [ ]:
automobile.isna().sum()

### Exercise 1: From the given dataset print the first and last five rows.

In [ ]:
automobile.tail()

In [ ]:
automobile.sample(2)

### Exercise 2: Clean the dataset and update the CSV file(Hint: pd.read_csv(na_values={})
Replace all column values which contain `?`, `n.a`, or `NaN.`

In [ ]:
# !cat datasets/Automobile_data.csv

In [ ]:
# find all the rows from the datframe where values are ?, n.a
# automobile[automobile=="sedan"].any(axis=1)
import numpy as np
np.nan

In [ ]:
automobile = pd.read_csv(file_path, na_values={'?':np.nan,
                                        'n.a':np.nan})

In [ ]:
automobile

### Exercise 3: Find the most expensive car company name
Print most expensive car’s company name and price.     
**Expected Output:**
![](images/pandas_printing_most_costly_car_name.png)

### Step by Step Solution

In [ ]:
# automobile['company'].value_counts()
# automobile.groupby('company').get_group('audi')
# automobile.groupby('company')[['price']].max().sort_values(by='price', ascending=False).head(1)

In [ ]:
a = automobile.groupby('company')[['price']].max().sort_values(by='price').tail(1)
a

In [ ]:
# First Method
a = automobile.groupby(['company'])['price'].max()
a.sort_values(ascending=False).reset_index().head(1)

In [ ]:
# Second Method
b = automobile[['company','price']][automobile['price'] == automobile['price'].max()]
b

In [ ]:
automobile[['company','price']][automobile.price == automobile.price.max()]

### Exercise 4: Print All Toyota Cars details
**Expected Output**
![](images/pandas_printing_all_toyota_car_data.png)

In [ ]:
# automobile[automobile.company == 'toyota']

In [ ]:
# # First Method
automobile[automobile['company'] == 'toyota']

In [ ]:
# # Second Method
group = automobile.groupby('company')
group.get_group('toyota')

### Exercise 5: Count total cars per company
**Expected Output**
![](images/pandas_count_total_cars_per_company.png)

In [ ]:
automobile.company.value_counts()

### Exercise 6: Find each company’s Higesht price car
**Expected Outcome:**
![](images/pandas_printing_each_companys_higesht_price_car.png)

In [ ]:
# First Method
automobile.groupby(['company'])['price'].max().reset_index()

In [ ]:
# Second Method
automobile.groupby('company')[['company','price']].max()

### Exercise 7: Find the average mileage of each car making company
**Expected Output:**
![](images/pandas_printing_average_mileage_of_each_car_making_company.png)

In [ ]:
automobile.columns

In [ ]:
# First Method
automobile.groupby(['company'])['average-mileage'].mean()

In [ ]:
# Second Method
result = automobile.groupby('company')
# result['company','average-mileage'].mean()

### Exercise 8: Sort all cars by Price column
**Expected Output:**
![](images/pandas_sort_all_cars_by_price_column.png)

In [ ]:
automobile.sort_values(by=['price'], ascending=False).head()

### Exercise 9: Concatenate two data frames using the following conditions
Create two data frames using the following two dictionaries.
![](images/pandas_concatenate_two_data_frames_and_create_key_for_each_data_frame.png)

In [ ]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}
German = pd.DataFrame(GermanCars)
Japan = pd.DataFrame(japaneseCars)
df = pd.concat([German,Japan], keys=['German','Japan'])
df

### Exercise 10: Merge two data frames using the following condition
Create two data frames using the following two Dicts, Merge two data frames, and append the second data frame as a new column to the first data frame.
![](images/merge_two_data_frames_and_append_new_data_frame_as_new-column.png)

In [ ]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}
price = pd.DataFrame.from_dict(Car_Price)
horsepower = pd.DataFrame.from_dict(car_Horsepower)

In [ ]:
price

In [ ]:
horsepower

In [ ]:
pd.merge(price,horsepower,on='Company')

## Pandas Data Visualization Exercise
This is just a quick exercise for you to review the various plots we showed earlier. Use **datasets/practice.csv** to replicate the following plots.

In [ ]:
import pandas as pd
import numpy as np

### Q-01: Import your dataset and also display first five rows of your dataset.

In [ ]:
df = pd.read_csv('datasets/practice')
df.head()

**Q-02: Create this scatter plot of `b` vs `a`. Note the color and size of the points. Also note the figure size. See if you can figure out how to stretch it in a similar fashion. Remeber back to your matplotlib lecture...**

In [ ]:
df.plot.scatter(x='b',y='a', color='g', s=10, figsize=(5,5), title="Scatter plot of b vs a")

**Create a histogram of the 'a' column.**

In [ ]:
# df.plot.hist(by= 'a', bins=20)

**These plots are okay, but they don't look very polished. Use style sheets to set the style to 'plt.style.use('ggplot') and redo the histogram from above. Also figure out how to add more `bins` and `alpha` to it.***

In [ ]:
import matplotlib.pyplot as plt
plt.style.use('ggplot')

**Create a boxplot comparing the `a` and `b` columns.**

In [ ]:
df[['a','b']].plot.box()

**Create a kde plot of the `d` column**

In [ ]:
df.plot('d', kind='kde',)

**Figure out how to increase the linewidth and make the linestyle dashed. (Note: You would usually not dash a kde plot line)**

**Create an area plot of all the columns for just the rows up to `30.` (hint: use `.ix`).**

# Pandas - Assignment No 01
- Click here to solve [Pandas - Assignment no 01](https://www.kaggle.com/code/ehtishamsadiq/pandas-assignment-no-01)

In [1]:
from IPython.core.display import HTML

style = """
    <style>
        body {
            background-color: #f2fff2;
        }
        h1 {
            text-align: center;
            font-weight: bold;
            font-size: 36px;
            color: #4295F4;
            text-decoration: underline;
            padding-top: 15px;
        }
        
        h2 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #4A000A;
            text-decoration: underline;
            padding-top: 10px;
        }
        
        h3 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #f0081e;
            text-decoration: underline;
            padding-top: 5px;
        }

        
        p {
            text-align: center;
            font-size: 12 px;
            color: #0B9923;
        }
    </style>
"""

html_content = """
<h1>Hello</h1>
<p>Hello World</p>
<h2> Hello</h2>
<h3> World </h3>
"""

HTML(style + html_content)